---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailBeginningTerminationTypeParam
source: html/1e46e051-78c1-7ae9-7b26-0c3438ca7bed.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailBeginningTerminationTypeParam Property

"Beginning/Bottom Termination"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailBeginningTerminationTypeParam { get; }
```